13/data/attachments/8c4f2fe94cf895cd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_23538b83-ec07-4fce-aea3-a1b54bbc0466</nif:username>
            <nif:friendToBeAdded>Jennifer_happy_Friend_50686_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>